In [3]:
import pandas as pd
import numpy as np

In [4]:
d1 = pd.DataFrame(np.random.randint(30,size=(3,3)),columns=['a','b','c']) 
d1

    a   b   c
0  19  12   4
1  17  21  12
2   2  12   6

In [5]:
d2 = pd.DataFrame(np.random.randint(30,size=(3,3)),columns=['p','q','r']) 
d2

    p   q   r
0   0  19   2
1  10  22  15
2  16  12  26

In [6]:
d2.drop("p",axis=1)

    q   r
0  19   2
1  22  15
2  12  26

In [7]:
pd.concat([d1,d2])

      a     b     c     p     q     r
0  19.0  12.0   4.0   NaN   NaN   NaN
1  17.0  21.0  12.0   NaN   NaN   NaN
2   2.0  12.0   6.0   NaN   NaN   NaN
0   NaN   NaN   NaN   0.0  19.0   2.0
1   NaN   NaN   NaN  10.0  22.0  15.0
2   NaN   NaN   NaN  16.0  12.0  26.0

In [8]:
d3 = pd.DataFrame(np.random.randint(30,size=(3,3)),index=['a','b','c']) 
d3

    0   1   2
a  28  28   9
b  29  28  11
c   1  16  28

In [9]:
pd.concat([d1,d2,d3],axis=1)

      a     b     c     p     q     r     0     1     2
0  19.0  12.0   4.0   0.0  19.0   2.0   NaN   NaN   NaN
1  17.0  21.0  12.0  10.0  22.0  15.0   NaN   NaN   NaN
2   2.0  12.0   6.0  16.0  12.0  26.0   NaN   NaN   NaN
a   NaN   NaN   NaN   NaN   NaN   NaN  28.0  28.0   9.0
b   NaN   NaN   NaN   NaN   NaN   NaN  29.0  28.0  11.0
c   NaN   NaN   NaN   NaN   NaN   NaN   1.0  16.0  28.0

In [10]:
df1 = pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8],'c':[1,6,4,6]})
df1

   a  b  c
0  1  5  1
1  2  6  6
2  3  7  4
3  4  8  6

In [11]:
df2 = pd.DataFrame({'a':[0,7,3,5],'b':[5,6,7,8],'d':[1,0,4,6]})
df2

   a  b  d
0  0  5  1
1  7  6  0
2  3  7  4
3  5  8  6

In [12]:
pd.merge(df1,df2,on='b',how="left")

   a_x  b  c  a_y  d
0    1  5  1    0  1
1    2  6  6    7  0
2    3  7  4    3  4
3    4  8  6    5  6

In [13]:
df1

   a  b  c
0  1  5  1
1  2  6  6
2  3  7  4
3  4  8  6

In [14]:
for i in df1.interpolate():
    print(df1[i])

0    1
1    2
2    3
3    4
Name: a, dtype: int64
0    5
1    6
2    7
3    8
Name: b, dtype: int64
0    1
1    6
2    4
3    6
Name: c, dtype: int64

In [15]:
idx = pd.date_range('7/8/2018',periods=4,freq='ME')

In [16]:
idx

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31'], dtype='datetime64[ns]', freq='ME')

In [17]:
idx

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31'], dtype='datetime64[ns]', freq='ME')

In [18]:
new = pd.DatetimeIndex(idx)
new

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31'], dtype='datetime64[ns]', freq='ME')

In [19]:
a = df1.reset_index()

In [20]:
a = pd.DataFrame([1,2,3,4])

In [21]:
a.reset_index()

   index  0
0      0  1
1      1  2
2      2  3
3      3  4

In [22]:
a.index=new
a.reset_index()

       index  0
0 2018-07-31  1
1 2018-08-31  2
2 2018-09-30  3
3 2018-10-31  4

In [23]:
a.resample(rule="M").mean().dtypes

C:\Users\Admin\AppData\Local\Temp\ipykernel_20820\666376133.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  a.resample(rule="M").mean().dtypes

0    float64
dtype: object

In [24]:
typ

NameError: name 'typ' is not defined

In [88]:
new.max()

0   2018-11-30
dtype: datetime64[ns]

In [ ]:
new.